#### Data Loading, Storage, Cleaning and Assembly with Python

In [4]:
import numpy as np
import pandas as pd

Load customer.csv file into dataframe customer, print the data.

In [5]:
df_cus = pd.read_csv('customer.csv')

# Remove unnamed column
df_cus.drop(df_cus.filter(regex="Unname"),axis=1, inplace=True)

print(df_cus)

   CUS_CODE CUS_LNAME CUS_FNAME
0     10010     Ramas    Alfred
1     10011     Dunne     Leona
2     10012     Smith     Kathy
3     10013   Olowski      Paul
4     10014   Orlando     Myron
5     10015   O'Brian       Amy
6     10016     Brown     James
7     10017  Williams    George
8     10018   Farriss      Anne
9     10019     Smith    Olette

Load invoice.csv file into dataframe invoice, print the data.

In [6]:
df_inv = pd.read_csv('invoice.csv')

# Remove unnamed column
df_inv.drop(df_inv.filter(regex="Unname"),axis=1, inplace=True)

print(df_inv)

   INV_NUMBER  CUS_CODE    INV_DATE
0        1001     10014  2012-01-16
1        1002     10011  2012-01-16
2        1003     10012  2012-01-16
3        1004     10011  2012-01-17
4        1005     10018  2012-01-17
5        1006     10014  2012-01-17
6        1007     10015  2012-01-17
7        1008     10011  2012-01-17

Count the number of invoices per customer from the invoice dataframe. Hint: call value_counts() function on CUS_CODE in dataframe invoice and print the result. value_counts() returns a dictionary of the list of unique values and the frequency of each.

In [7]:
num_inv_per_customer = df_inv['CUS_CODE'].value_counts()
print(num_inv_per_customer)

10011    3
10014    2
10012    1
10018    1
10015    1
Name: CUS_CODE, dtype: int64

Add the following row in dataframe customer: 10020 Smith James that correspond to customer code, last name and first name respectively. Then print dataframe customer.

In [10]:
df1 = pd.DataFrame([[10020, 'Smith', 'James']], columns=['CUS_CODE','CUS_LNAME','CUS_FNAME'])
df_cus = pd.concat([df_cus, df1]).reset_index(drop=True)

print(df_cus)

    CUS_CODE CUS_LNAME CUS_FNAME
0      10010     Ramas    Alfred
1      10011     Dunne     Leona
2      10012     Smith     Kathy
3      10013   Olowski      Paul
4      10014   Orlando     Myron
5      10015   O'Brian       Amy
6      10016     Brown     James
7      10017  Williams    George
8      10018   Farriss      Anne
9      10019     Smith    Olette
10     10020     Smith     James

Merge the customer and invoice dataframes and show all customers from dataframe customer.

In [11]:
cus_inv1 = df_cus.merge(df_inv, on='CUS_CODE', how='left')
print(cus_inv1)

    CUS_CODE CUS_LNAME CUS_FNAME  INV_NUMBER    INV_DATE
0      10010     Ramas    Alfred         NaN         NaN
1      10011     Dunne     Leona      1002.0  2012-01-16
2      10011     Dunne     Leona      1004.0  2012-01-17
3      10011     Dunne     Leona      1008.0  2012-01-17
4      10012     Smith     Kathy      1003.0  2012-01-16
5      10013   Olowski      Paul         NaN         NaN
6      10014   Orlando     Myron      1001.0  2012-01-16
7      10014   Orlando     Myron      1006.0  2012-01-17
8      10015   O'Brian       Amy      1007.0  2012-01-17
9      10016     Brown     James         NaN         NaN
10     10017  Williams    George         NaN         NaN
11     10018   Farriss      Anne      1005.0  2012-01-17
12     10019     Smith    Olette         NaN         NaN
13     10020     Smith     James         NaN         NaN

Merge the customer and invoice dataframes and show all matched and unmatched rows from both dataframes.

In [12]:
cus_inv2 = df_cus.merge(df_inv, on='CUS_CODE', how='outer')
print(cus_inv2)

    CUS_CODE CUS_LNAME CUS_FNAME  INV_NUMBER    INV_DATE
0      10010     Ramas    Alfred         NaN         NaN
1      10011     Dunne     Leona      1002.0  2012-01-16
2      10011     Dunne     Leona      1004.0  2012-01-17
3      10011     Dunne     Leona      1008.0  2012-01-17
4      10012     Smith     Kathy      1003.0  2012-01-16
5      10013   Olowski      Paul         NaN         NaN
6      10014   Orlando     Myron      1001.0  2012-01-16
7      10014   Orlando     Myron      1006.0  2012-01-17
8      10015   O'Brian       Amy      1007.0  2012-01-17
9      10016     Brown     James         NaN         NaN
10     10017  Williams    George         NaN         NaN
11     10018   Farriss      Anne      1005.0  2012-01-17
12     10019     Smith    Olette         NaN         NaN

Merge the two dataframes customer and invoice into dataframe customerInvoice using inner jcus_inv1oin.

In [8]:
customerInvoice = df_cus.merge(df_inv, on='CUS_CODE', how="inner")
print(customerInvoice)

   CUS_CODE CUS_LNAME CUS_FNAME  INV_NUMBER    INV_DATE
0     10011     Dunne     Leona        1002  2012-01-16
1     10011     Dunne     Leona        1004  2012-01-17
2     10011     Dunne     Leona        1008  2012-01-17
3     10012     Smith     Kathy        1003  2012-01-16
4     10014   Orlando     Myron        1001  2012-01-16
5     10014   Orlando     Myron        1006  2012-01-17
6     10015   O'Brian       Amy        1007  2012-01-17
7     10018   Farriss      Anne        1005  2012-01-17

Write customerInvoice data to a customerInvoice.csv file.

In [86]:
customerInvoice.to_csv('customerInvoice.csv', index=False)

Load the three datasets from https://github.com/jakevdp/data-USstates/ into dataframes called population, area and abbreviation

In [9]:
population_url = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-population.csv'
population = pd.read_csv(population_url)

area_url = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-areas.csv'
area = pd.read_csv(area_url)

abbreviation_url = 'https://raw.githubusercontent.com/jakevdp/data-USstates/master/state-abbrevs.csv'
abbreviation = pd.read_csv(abbreviation_url)

Print the three dataframes you have created in last step one by one

In [10]:
print("Population")
print(population)

Population
     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
...           ...      ...   ...          ...
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]

In [11]:
print("Area")
print(area)

Area
                   state  area (sq. mi)
0                Alabama          52423
1                 Alaska         656425
2                Arizona         114006
3               Arkansas          53182
4             California         163707
5               Colorado         104100
6            Connecticut           5544
7               Delaware           1954
8                Florida          65758
9                Georgia          59441
10                Hawaii          10932
11                 Idaho          83574
12              Illinois          57918
13               Indiana          36420
14                  Iowa          56276
15                Kansas          82282
16              Kentucky          40411
17             Louisiana          51843
18                 Maine          35387
19              Maryland          12407
20         Massachusetts          10555
21              Michigan          96810
22             Minnesota          86943
23           Mississippi          48434
24              Missouri          69709
25               Montana         147046
26              Nebraska          77358
27                Nevada         110567
28         New Hampshire           9351
29            New Jersey           8722
30            New Mexico         121593
31              New York          54475
32        North Carolina          53821
33          North Dakota          70704
34                  Ohio          44828
35              Oklahoma          69903
36                Oregon          98386
37          Pennsylvania          46058
38          Rhode Island           1545
39        South Carolina          32007
40          South Dakota          77121
41             Tennessee          42146
42                 Texas         268601
43                  Utah          84904
44               Vermont           9615
45              Virginia          42769
46            Washington          71303
47         West Virginia          24231
48             Wisconsin          65503
49               Wyoming          97818
50  District of Columbia             68
51           Puerto Rico           3515

In [12]:
print("Abbreviation")
print(abbreviation)

Abbreviation
                   state abbreviation
0                Alabama           AL
1                 Alaska           AK
2                Arizona           AZ
3               Arkansas           AR
4             California           CA
5               Colorado           CO
6            Connecticut           CT
7               Delaware           DE
8   District of Columbia           DC
9                Florida           FL
10               Georgia           GA
11                Hawaii           HI
12                 Idaho           ID
13              Illinois           IL
14               Indiana           IN
15                  Iowa           IA
16                Kansas           KS
17              Kentucky           KY
18             Louisiana           LA
19                 Maine           ME
20               Montana           MT
21              Nebraska           NE
22                Nevada           NV
23         New Hampshire           NH
24            New Jersey           NJ
25            New Mexico           NM
26              New York           NY
27        North Carolina           NC
28          North Dakota           ND
29                  Ohio           OH
30              Oklahoma           OK
31                Oregon           OR
32              Maryland           MD
33         Massachusetts           MA
34              Michigan           MI
35             Minnesota           MN
36           Mississippi           MS
37              Missouri           MO
38          Pennsylvania           PA
39          Rhode Island           RI
40        South Carolina           SC
41          South Dakota           SD
42             Tennessee           TN
43                 Texas           TX
44                  Utah           UT
45               Vermont           VT
46              Virginia           VA
47            Washington           WA
48         West Virginia           WV
49             Wisconsin           WI
50               Wyoming           WY

Do a many-to-one merge to give us the full state name along with the population.Pick the columns you will use for merging

In [14]:
fstate_population = population.merge(abbreviation, left_on='state/region', right_on='abbreviation')
print(fstate_population)

     state/region     ages  year  population    state abbreviation
0              AL  under18  2012   1117489.0  Alabama           AL
1              AL    total  2012   4817528.0  Alabama           AL
2              AL  under18  2010   1130966.0  Alabama           AL
3              AL    total  2010   4785570.0  Alabama           AL
4              AL  under18  2011   1125763.0  Alabama           AL
...           ...      ...   ...         ...      ...          ...
2443           WY  under18  1993    137458.0  Wyoming           WY
2444           WY    total  1991    459260.0  Wyoming           WY
2445           WY  under18  1991    136720.0  Wyoming           WY
2446           WY  under18  1990    136078.0  Wyoming           WY
2447           WY    total  1990    453690.0  Wyoming           WY

[2448 rows x 6 columns]

Your output from the last command is only displaying data for Alabama state, kindly fix your code to display information for all the states.

In [15]:
# Unlike what is described in the question, the previous command displays results for all states
# To see other results, let us print more data
print(fstate_population.head(120))

# For instance, we can see in the result below that Arizona is included in the result sets

    state/region     ages  year  population    state abbreviation
0             AL  under18  2012   1117489.0  Alabama           AL
1             AL    total  2012   4817528.0  Alabama           AL
2             AL  under18  2010   1130966.0  Alabama           AL
3             AL    total  2010   4785570.0  Alabama           AL
4             AL  under18  2011   1125763.0  Alabama           AL
..           ...      ...   ...         ...      ...          ...
115           AZ  under18  2004   1484454.0  Arizona           AZ
116           AZ    total  2003   5510364.0  Arizona           AZ
117           AZ  under18  2003   1453671.0  Arizona           AZ
118           AZ    total  2001   5273477.0  Arizona           AZ
119           AZ  under18  2001   1399015.0  Arizona           AZ

[120 rows x 6 columns]

Is Puerto Rico included in your result set? If not, fix your code to add it as a new state

In [16]:
# Check if Puerto Rico is included in the result set
check_puerto_rico = 'Puerto Rico' in fstate_population['state'].values
print(check_puerto_rico)

False

In [17]:
# The result returns False which means that Puerto Rico was not found in the result set

# Adding Puerto Rico as a new state
pr_df = pd.DataFrame([['Puerto Rico','PR']], columns=['state', 'abbreviation'])
abbreviation = pd.concat([abbreviation, pr_df]).reset_index(drop=True)

print("Puerto Rico added")
print(abbreviation)

# Now Puerto Rico is added at the end of the abbreviation dataframe

print("New merged result of population and abbreviation")
fstate_population = population.merge(abbreviation, left_on='state/region', right_on='abbreviation')
print(fstate_population)

Puerto Rico added
                   state abbreviation
0                Alabama           AL
1                 Alaska           AK
2                Arizona           AZ
3               Arkansas           AR
4             California           CA
5               Colorado           CO
6            Connecticut           CT
7               Delaware           DE
8   District of Columbia           DC
9                Florida           FL
10               Georgia           GA
11                Hawaii           HI
12                 Idaho           ID
13              Illinois           IL
14               Indiana           IN
15                  Iowa           IA
16                Kansas           KS
17              Kentucky           KY
18             Louisiana           LA
19                 Maine           ME
20               Montana           MT
21              Nebraska           NE
22                Nevada           NV
23         New Hampshire           NH
24            New Jersey           NJ
25            New Mexico           NM
26              New York           NY
27        North Carolina           NC
28          North Dakota           ND
29                  Ohio           OH
30              Oklahoma           OK
31                Oregon           OR
32              Maryland           MD
33         Massachusetts           MA
34              Michigan           MI
35             Minnesota           MN
36           Mississippi           MS
37              Missouri           MO
38          Pennsylvania           PA
39          Rhode Island           RI
40        South Carolina           SC
41          South Dakota           SD
42             Tennessee           TN
43                 Texas           TX
44                  Utah           UT
45               Vermont           VT
46              Virginia           VA
47            Washington           WA
48         West Virginia           WV
49             Wisconsin           WI
50               Wyoming           WY
51           Puerto Rico           PR
New merged result of population and abbreviation
     state/region     ages  year  population        state abbreviation
0              AL  under18  2012   1117489.0      Alabama           AL
1              AL    total  2012   4817528.0      Alabama           AL
2              AL  under18  2010   1130966.0      Alabama           AL
3              AL    total  2010   4785570.0      Alabama           AL
4              AL  under18  2011   1125763.0      Alabama           AL
...           ...      ...   ...         ...          ...          ...
2491           PR  under18  2010    896945.0  Puerto Rico           PR
2492           PR  under18  2011    869327.0  Puerto Rico           PR
2493           PR    total  2011   3686580.0  Puerto Rico           PR
2494           PR  under18  2012    841740.0  Puerto Rico           PR
2495           PR    total  2012   3651545.0  Puerto Rico           PR

[2496 rows x 6 columns]

Now merge the result set with area so we can see the following information as one:
state/region 	ages 	year 	population 	state 	area (sq. mi)

In [18]:
# Merging
merged_sets = fstate_population.merge(area, on='state')
merged_sets = merged_sets.drop('abbreviation', axis=1)
print(merged_sets)

     state/region     ages  year  population        state  area (sq. mi)
0              AL  under18  2012   1117489.0      Alabama          52423
1              AL    total  2012   4817528.0      Alabama          52423
2              AL  under18  2010   1130966.0      Alabama          52423
3              AL    total  2010   4785570.0      Alabama          52423
4              AL  under18  2011   1125763.0      Alabama          52423
...           ...      ...   ...         ...          ...            ...
2491           PR  under18  2010    896945.0  Puerto Rico           3515
2492           PR  under18  2011    869327.0  Puerto Rico           3515
2493           PR    total  2011   3686580.0  Puerto Rico           3515
2494           PR  under18  2012    841740.0  Puerto Rico           3515
2495           PR    total  2012   3651545.0  Puerto Rico           3515

[2496 rows x 6 columns]

Load titanic.csv file into dataframe named titanic, print the data

In [19]:
titanic = pd.read_csv('titanic.csv')
print(titanic)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone
0      man        True  NaN  Southampton    no  False
1    woman       False    C    Cherbourg   yes  False
2    woman       False  NaN  Southampton   yes   True
3    woman       False    C  Southampton   yes  False
4      man        True  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
886    man        True  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True
888  woman       False  NaN  Southampton    no  False
889    man        True    C    Cherbourg   yes   True
890    man        True  NaN   Queenstown    no   True

[891 rows x 15 columns]

Pivot the dataframe to hold information in the following format:
class 	                                  First 	Second  	  Third
sex 			
female  	                              0.968085  	0.921053 	0.500000
male 	                                  0.368852  	0.157407 	0.135447

In [20]:
tin_pivot_df1 = titanic.pivot_table(index='sex', columns=['class'], values='survived', aggfunc='mean')
print(tin_pivot_df1)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

Pivot the table further to hold information in the following format:
     	    class 	First 	Second 	Third
sex 	age 			
female 	(0, 18] 	0.909091 	1.000000 	0.511628
(18, 80] 	0.972973 	0.900000 	0.423729
male 	(0, 18] 	0.800000 	0.600000 	0.215686
(18, 80] 	0.375000 	0.071429 	0.133663

In [21]:
bins = [0, 18, 80]
titanic['age '] = pd.cut(titanic['age'], bins)
tin_pivot_dftest = titanic.pivot_table(index=['sex', 'age '], columns='class', values='survived')
print(tin_pivot_dftest)

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 80]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 80]  0.375000  0.071429  0.133663

Pivot the table further to hold information in the following format:
fare 	survived
class 	First 	Second 	Third 	First 	Second 	Third
sex 						
female 	106.125798 	21.970121 	16.118810 	91.0 	70.0 	72.0
male 	67.226127 	19.741782 	12.661633 	45.0 	17.0 	47.0

In [22]:
tin_pivot_3 = titanic.pivot_table(index='sex',columns='class', values=['fare', 'survived'], aggfunc={'fare':'mean', 'survived':'sum'})
print(tin_pivot_3)

              fare                       survived
class        First     Second      Third    First Second Third
sex
female  106.125798  21.970121  16.118810       91     70    72
male     67.226127  19.741782  12.661633       45     17    47

Write the command to establish a connection to the database, write the necessary imports as well.

In [23]:
import mysql.connector as sql

# Create a connection
mydb = sql.connect(
    host="localhost",
    user="root",
    password="hngX233!",
    database="labs",
    use_pure = True
)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x0000021B96AA9F90>

Write a query to retrieve data from the table called "countries"

In [25]:
cursor = mydb.cursor()

country_query = "SELECT * FROM countries"

cursor.execute(country_query)

result = cursor.fetchall()
    
df1 = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df1)

   country_id              country_name  region_id
0          AR                 Argentina          2
1          AU                 Australia          3
2          BE                   Belgium          1
3          BR                    Brazil          2
4          CA                    Canada          2
5          CH               Switzerland          1
6          CN                     China          3
7          DE                   Germany          1
8          DK                   Denmark          1
9          EG                     Egypt          4
10         FR                    France          1
11         HK                  HongKong          3
12         IL                    Israel          4
13         IN                     India          3
14         IT                     Italy          1
15         JP                     Japan          3
16         KW                    Kuwait          4
17         MX                    Mexico          2
18         NG                   Nigeria          4
19         NL               Netherlands          1
20         SG                 Singapore          3
21         UK            United Kingdom          1
22         US  United States of America          2
23         ZM                    Zambia          4
24         ZW                  Zimbabwe          4

Write a query to report the street address and city of all locations that their city name starts with ‘M’. 
Provide the alias “Street Address” for the street address column.

In [8]:
location_query = "SELECT street_address as `Street Address`, city from locations WHERE city LIKE 'M%'"

cursor.execute(location_query)

result = cursor.fetchall()
    
df2 = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df2)

          Street Address         city
0  Schwanthalerstr. 7031       Munich
1  Mariano Escobedo 9991  Mexico City

Write a query to count the total number of employees working in each department.

In [27]:
employee_dep_query = "SELECT department_id as `Department ID`, COUNT(*) AS `Total workers` FROM employees GROUP BY department_id"

cursor.execute(employee_dep_query)

result = cursor.fetchall()

df3 = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df3)

  Department ID  Total workers
0            60              3
1            50              5
2            80              3
3            10              1
4          None              1
5            90              3
6            20              2
7           110              2

Write a query to print the name of employee along with the complete address of their department.

In [14]:
query = "SELECT e.first_name, e.last_name, d.department_id, d.department_name, d.location_id FROM employees e JOIN departments d ON e.department_id = d.department_id"

cursor.execute(query)

result = cursor.fetchall()

df4 = pd.DataFrame(result, columns=[i[0] for i in cursor.description])
print(df4)

   first_name  last_name  department_id department_name  location_id
0   Alexander     Hunold             60              IT         1400
1       Bruce      Ernst             60              IT         1400
2      Curtis     Davies             50        Shipping         1500
3       Diana    Lorentz             60              IT         1400
4       Ellen       Abel             80           Sales         2500
5       Eleni    Zlotkey             80           Sales         2500
6    Jonathon     Taylor             80           Sales         2500
7    Jennifer     Whalen             10  Administration         1700
8       Kevin    Mourgos             50        Shipping         1500
9         Lex    De Haan             90       Executive         1700
10    Michael  Hartstein             20       Marketing         1800
11      Neena    Kochhar             90       Executive         1700
12        Pat        Fay             20       Marketing         1800
13      Peter     Vargas             50        Shipping         1500
14    Randall      Matos             50        Shipping         1500
15    Shelley    Higgins            110      Accounting         1700
16     Steven       King             90       Executive         1700
17     Trenna       Rajs             50        Shipping         1500
18    William      Gietz            110      Accounting         1700

Close the connection

In [28]:
cursor.close() # close the cursor
mydb.close()